node {
  name: "u"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "u"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "v"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "v"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "coordsX"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "coordsX"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "coordsY"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "coordsY"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 25
        }
      }
    }
  }
}
node {
  name: "dt"
  op: "Placeholder"
  attr {
    key: "_user_specified_name"
    value {
      s: "dt"
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "StatefulPartitionedCall"
  op: "StatefulPartitionedCall"
  input: "u"
  input: "v"
  input: "coordsX"
  input: "coordsY"
  input: "dt"
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_RESOURCE
        type: DT_FLOAT
        type: DT_FLOAT
        type: DT_RESOURCE
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "_collective_manager_ids"
    value {
      list {
      }
    }
  }
  attr {
    key: "_read_only_resource_inputs"
    value {
      list {
        i: 0
        i: 1
        i: 4
      }
    }
  }
  attr {
    key: "config"
    value {
      s: ""
    }
  }
  attr {
    key: "config_proto"
    value {
      s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0002\002J\0008\001\202\001\000"
    }
  }
  attr {
    key: "executor_type"
    value {
      s: ""
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_advectionVelocity_8127"
      }
    }
  }
}
node {
  name: "Identity"
  op: "Identity"
  input: "StatefulPartitionedCall"
  input: "^NoOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Identity_1"
  op: "Identity"
  input: "StatefulPartitionedCall:1"
  input: "^NoOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "NoOp"
  op: "NoOp"
  input: "^StatefulPartitionedCall"
  attr {
    key: "_acd_function_control_output"
    value {
      b: true
    }
  }
}
library {
  function {
    signature {
      name: "Gather_3_pfor_while_body_2803"
      input_arg {
        name: "gather_3_pfor_while_gather_3_pfor_while_loop_counter"
        type: DT_INT32
      }
      input_arg {
        name: "gather_3_pfor_while_gather_3_pfor_while_maximum_iterations"
        type: DT_INT32
      }
      input_arg {
        name: "gather_3_pfor_while_placeholder"
        type: DT_INT32
      }
      input_arg {
        name: "gather_3_pfor_while_placeholder_1"
        type: DT_VARIANT
      }
      input_arg {
        name: "gather_3_pfor_while_gather_3_pfor_strided_slice_0"
        type: DT_INT32
      }
      input_arg {
        name: "gather_3_pfor_while_strided_slice_cast_3_pfor_cast_0"
        type: DT_INT32
      }
      input_arg {
        name: "gather_3_pfor_while_args_2_0"
        type: DT_RESOURCE
      }
      output_arg {
        name: "gather_3_pfor_while_identity"
        type: DT_INT32
      }
      output_arg {
        name: "gather_3_pfor_while_identity_1"
        type: DT_INT32
      }
      output_arg {
        name: "gather_3_pfor_while_identity_2"
        type: DT_INT32
      }
      output_arg {
        name: "gather_3_pfor_while_identity_3"
        type: DT_VARIANT
      }
      output_arg {
        name: "gather_3_pfor_while_gather_3_pfor_strided_slice"
        type: DT_INT32
      }
      output_arg {
        name: "gather_3_pfor_while_strided_slice_cast_3_pfor_cast"
        type: DT_INT32
      }
      output_arg {
        name: "gather_3_pfor_while_args_2"
        type: DT_RESOURCE
      }
      is_stateful: true
      control_output: "Gather_3/pfor/while/ResourceGather"
    }
    node_def {
      name: "Gather_3/pfor/while/add/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/add"
      op: "AddV2"
      input: "gather_3_pfor_while_placeholder"
      input: "Gather_3/pfor/while/add/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice/stack/1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice/stack"
      op: "Pack"
      input: "gather_3_pfor_while_placeholder"
      input: "Gather_3/pfor/while/strided_slice/stack/1:output:0"
      attr {
        key: "N"
        value {
          i: 2
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice/stack_1/1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice/stack_1"
      op: "Pack"
      input: "Gather_3/pfor/while/add:z:0"
      input: "Gather_3/pfor/while/strided_slice/stack_1/1:output:0"
      attr {
        key: "N"
        value {
          i: 2
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "axis"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 2
              }
            }
            tensor_content: "\001\000\000\000\001\000\000\000"
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/strided_slice"
      op: "StridedSlice"
      input: "gather_3_pfor_while_strided_slice_cast_3_pfor_cast_0"
      input: "Gather_3/pfor/while/strided_slice/stack:output:0"
      input: "Gather_3/pfor/while/strided_slice/stack_1:output:0"
      input: "Gather_3/pfor/while/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 2
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 1
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/ResourceGather"
      op: "ResourceGather"
      input: "gather_3_pfor_while_args_2_0"
      input: "Gather_3/pfor/while/strided_slice:output:0"
      attr {
        key: "Tindices"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "batch_dims"
        value {
          i: 0
        }
      }
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "validate_indices"
        value {
          b: true
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/ExpandDims/dim"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/ExpandDims"
      op: "ExpandDims"
      input: "Gather_3/pfor/while/ResourceGather:output:0"
      input: "Gather_3/pfor/while/ExpandDims/dim:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tdim"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/TensorArrayV2Write/TensorListSetItem"
      op: "TensorListSetItem"
      input: "gather_3_pfor_while_placeholder_1"
      input: "gather_3_pfor_while_placeholder"
      input: "Gather_3/pfor/while/ExpandDims:output:0"
      attr {
        key: "element_dtype"
        value {
          type: DT_FLOAT
        }
      }
      experimental_type {
        type_id: TFT_PRODUCT
        args {
          type_id: TFT_ARRAY
          args {
            type_id: TFT_TENSOR
            args {
              type_id: TFT_FLOAT
            }
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/add_1/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/add_1"
      op: "AddV2"
      input: "gather_3_pfor_while_placeholder"
      input: "Gather_3/pfor/while/add_1/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/add_2/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/add_2"
      op: "AddV2"
      input: "gather_3_pfor_while_gather_3_pfor_while_loop_counter"
      input: "Gather_3/pfor/while/add_2/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/Identity"
      op: "Identity"
      input: "Gather_3/pfor/while/add_2:z:0"
      input: "^Gather_3/pfor/while/NoOp"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/Identity_1"
      op: "Identity"
      input: "gather_3_pfor_while_gather_3_pfor_while_maximum_iterations"
      input: "^Gather_3/pfor/while/NoOp"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/Identity_2"
      op: "Identity"
      input: "Gather_3/pfor/while/add_1:z:0"
      input: "^Gather_3/pfor/while/NoOp"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/Identity_3"
      op: "Identity"
      input: "Gather_3/pfor/while/TensorArrayV2Write/TensorListSetItem:output_handle:0"
      input: "^Gather_3/pfor/while/NoOp"
      attr {
        key: "T"
        value {
          type: DT_VARIANT
        }
      }
    }
    node_def {
      name: "Gather_3/pfor/while/NoOp"
      op: "NoOp"
      input: "^Gather_3/pfor/while/ResourceGather"
      attr {
        key: "_acd_function_control_output"
        value {
          b: true
        }
      }
    }
    ret {
      key: "gather_3_pfor_while_args_2"
      value: "gather_3_pfor_while_args_2_0"
    }
    ret {
      key: "gather_3_pfor_while_gather_3_pfor_strided_slice"
      value: "gather_3_pfor_while_gather_3_pfor_strided_slice_0"
    }
    ret {
      key: "gather_3_pfor_while_identity"
      value: "Gather_3/pfor/while/Identity:output:0"
    }
    ret {
      key: "gather_3_pfor_while_identity_1"
      value: "Gather_3/pfor/while/Identity_1:output:0"
    }
    ret {
      key: "gather_3_pfor_while_identity_2"
      value: "Gather_3/pfor/while/Identity_2:output:0"
    }
    ret {
      key: "gather_3_pfor_while_identity_3"
      value: "Gather_3/pfor/while/Identity_3:output:0"
    }
    ret {
      key: "gather_3_pfor_while_strided_slice_cast_3_pfor_cast"
      value: "gather_3_pfor_while_strided_slice_cast_3_pfor_cast_0"
    }
    attr {
      key: "_construction_context"
      value {
        s: "kEagerRuntime"
      }
    }
    control_ret {
      key: "Gather_3/pfor/while/ResourceGather"
      value: "Gather_3/pfor/while/ResourceGather"
    }
    arg_attr {
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
              }
            }
          }
        }
      }
    }
    arg_attr {
      key: 1
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
              }
            }
          }
        }
      }
    }
    arg_attr {
      key: 2
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
              }
            }
          }
        }
      }
    }
    arg_attr {
      key: 3
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
              }
            }
          }
        }
      }
    }
    arg_attr {
      key: 4
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
              }
            }
          }
        }
      }
    }
    arg_attr {
      key: 5
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
                dim {
                  size: 25
                }
              }
            }
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_advectionVelocity_8127"
      input_arg {
        name: "u"
        type: DT_RESOURCE
      }
      input_arg {
        name: "v"
        type: DT_RESOURCE
      }
      input_arg {
        name: "coordsx"
        type: DT_FLOAT
      }
      input_arg {
        name: "coordsy"
        type: DT_FLOAT
      }
      input_arg {
        name: "dt"
        type: DT_RESOURCE
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      output_arg {
        name: "identity_1"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "StatefulPartitionedCall"
      control_output: "StatefulPartitionedCall_1"
    }
    node_def {
      name: "StatefulPartitionedCall"
      op: "StatefulPartitionedCall"
      input: "u"
      input: "v"
      input: "coordsx"
      input: "coordsy"
      input: "dt"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_FLOAT
            type: DT_FLOAT
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_collective_manager_ids"
        value {
          list {
          }
        }
      }
      attr {
        key: "_read_only_resource_inputs"
        value {
          list {
            i: 0
            i: 1
            i: 4
          }
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0002\002J\0008\001\202\001\000"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_advectStaggeredU_4140"
          }
        }
      }
    }
    node_def {
      name: "StatefulPartitionedCall_1"
      op: "StatefulPartitionedCall"
      input: "u"
      input: "v"
      input: "coordsx"
      input: "coordsy"
      input: "dt"
      attr {
        key: "Tin"
        value {
          list {
            type: DT_RESOURCE
            type: DT_RESOURCE
            type: DT_FLOAT
            type: DT_FLOAT
            type: DT_RESOURCE
          }
        }
      }
      attr {
        key: "Tout"
        value {
          list {
            type: DT_FLOAT
          }
        }
      }
      attr {
        key: "_collective_manager_ids"
        value {
          list {
          }
        }
      }
      attr {
        key: "_read_only_resource_inputs"
        value {
          list {
            i: 0
            i: 1
            i: 4
          }
        }
      }
      attr {
        key: "config"
        value {
          s: ""
        }
      }
      attr {
        key: "config_proto"
        value {
          s: "\n\007\n\003CPU\020\001\n\007\n\003GPU\020\0002\002J\0008\001\202\001\000"
        }
      }
      attr {
        key: "executor_type"
        value {
          s: ""
        }
      }
      attr {
        key: "f"
        value {
          func {
            name: "__inference_advectStaggeredV_8120"
          }
        }
      }
    }
    node_def {
      name: "Identity"
      op: "Identity"
      input: "StatefulPartitionedCall:output:0"
      input: "^NoOp"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "Identity_1"
      op: "Identity"
      input: "StatefulPartitionedCall_1:output:0"
      input: "^NoOp"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "NoOp"
      op: "NoOp"
      input: "^StatefulPartitionedCall"
      input: "^StatefulPartitionedCall_1"
      attr {
        key: "_acd_function_control_output"
        value {
          b: true
        }
      }
    }
    ret {
      key: "identity"
      value: "Identity:output:0"
    }
    ret {
      key: "identity_1"
      value: "Identity_1:output:0"
    }
    attr {
      key: "_construction_context"
      value {
        s: "kEagerRuntime"
      }
    }
    control_ret {
      key: "StatefulPartitionedCall"
      value: "StatefulPartitionedCall"
    }
    control_ret {
      key: "StatefulPartitionedCall_1"
      value: "StatefulPartitionedCall_1"
    }
    arg_attr {
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "u"
          }
        }
      }
    }
    arg_attr {
      key: 1
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "v"
          }
        }
      }
    }
    arg_attr {
      key: 2
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
                dim {
                  size: 25
                }
              }
            }
          }
        }
        attr {
          key: "_user_specified_name"
          value {
            s: "coordsX"
          }
        }
      }
    }
    arg_attr {
      key: 3
      value {
        attr {
          key: "_output_shapes"
          value {
            list {
              shape {
                dim {
                  size: 25
                }
              }
            }
          }
        }
        attr {
          key: "_user_specified_name"
          value {
            s: "coordsY"
          }
        }
      }
    }
    arg_attr {
      key: 4
      value {
        attr {
          key: "_user_specified_name"
          value {
            s: "dt"
          }
        }
      }
    }
  }
  function {
    signature {
      name: "__inference_f_4137"
      input_arg {
        name: "args_0"
        type: DT_FLOAT
      }
      input_arg {
        name: "args_1"
        type: DT_FLOAT
      }
      input_arg {
        name: "args_2"
        type: DT_RESOURCE
      }
      input_arg {
        name: "partitionedcall_1_pfor_strided_slice_loop_body_1_statefulpartitionedcall_pfor_reshape"
        type: DT_INT32
      }
      output_arg {
        name: "identity"
        type: DT_FLOAT
      }
      is_stateful: true
      control_output: "Gather/pfor/while"
      control_output: "Gather_1/pfor/while"
      control_output: "Gather_2/pfor/while"
      control_output: "Gather_3/pfor/while"
    }
    node_def {
      name: "clip_by_value_3/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "clip_by_value_3/Minimum/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 4.0
          }
        }
      }
    }
    node_def {
      name: "add_1/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 1.0
          }
        }
      }
    }
    node_def {
      name: "clip_by_value_1/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.0
          }
        }
      }
    }
    node_def {
      name: "clip_by_value_1/Minimum/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 4.0
          }
        }
      }
    }
    node_def {
      name: "sub_3/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.5
          }
        }
      }
    }
    node_def {
      name: "truediv_1/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: 0.4000000059604645
          }
        }
      }
    }
    node_def {
      name: "sub_2/y/pfor/Const"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_FLOAT
            tensor_shape {
            }
            float_val: -1.0
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Rank"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Rank_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/add/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/add"
      op: "AddV2"
      input: "sub_2/pfor/Rank_1:output:0"
      input: "sub_2/pfor/add/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Maximum"
      op: "Maximum"
      input: "sub_2/pfor/add:z:0"
      input: "sub_2/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 25
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/sub"
      op: "Sub"
      input: "sub_2/pfor/Maximum:z:0"
      input: "sub_2/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Reshape/shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Reshape"
      op: "Reshape"
      input: "sub_2/pfor/sub:z:0"
      input: "sub_2/pfor/Reshape/shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Tile/input"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Tile"
      op: "Tile"
      input: "sub_2/pfor/Tile/input:output:0"
      input: "sub_2/pfor/Reshape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tmultiples"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice"
      op: "StridedSlice"
      input: "sub_2/pfor/Shape:output:0"
      input: "sub_2/pfor/strided_slice/stack:output:0"
      input: "sub_2/pfor/strided_slice/stack_1:output:0"
      input: "sub_2/pfor/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 1
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice_1/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice_1/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice_1/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/strided_slice_1"
      op: "StridedSlice"
      input: "sub_2/pfor/Shape:output:0"
      input: "sub_2/pfor/strided_slice_1/stack:output:0"
      input: "sub_2/pfor/strided_slice_1/stack_1:output:0"
      input: "sub_2/pfor/strided_slice_1/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 1
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "sub_2/pfor/concat/axis"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_2/pfor/concat"
      op: "ConcatV2"
      input: "sub_2/pfor/strided_slice:output:0"
      input: "sub_2/pfor/Tile:output:0"
      input: "sub_2/pfor/strided_slice_1:output:0"
      input: "sub_2/pfor/concat/axis:output:0"
      attr {
        key: "N"
        value {
          i: 3
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tidx"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Reshape_1"
      op: "Reshape"
      input: "args_1"
      input: "sub_2/pfor/concat:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_2/pfor/Sub_1"
      op: "Sub"
      input: "sub_2/pfor/Reshape_1:output:0"
      input: "sub_2/y/pfor/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Rank"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Rank_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/add/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/add"
      op: "AddV2"
      input: "truediv_1/pfor/Rank_1:output:0"
      input: "truediv_1/pfor/add/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Maximum"
      op: "Maximum"
      input: "truediv_1/pfor/add:z:0"
      input: "truediv_1/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 25
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/sub"
      op: "Sub"
      input: "truediv_1/pfor/Maximum:z:0"
      input: "truediv_1/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Reshape/shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Reshape"
      op: "Reshape"
      input: "truediv_1/pfor/sub:z:0"
      input: "truediv_1/pfor/Reshape/shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Tile/input"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Tile"
      op: "Tile"
      input: "truediv_1/pfor/Tile/input:output:0"
      input: "truediv_1/pfor/Reshape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tmultiples"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice"
      op: "StridedSlice"
      input: "truediv_1/pfor/Shape:output:0"
      input: "truediv_1/pfor/strided_slice/stack:output:0"
      input: "truediv_1/pfor/strided_slice/stack_1:output:0"
      input: "truediv_1/pfor/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 1
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice_1/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice_1/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice_1/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/strided_slice_1"
      op: "StridedSlice"
      input: "truediv_1/pfor/Shape:output:0"
      input: "truediv_1/pfor/strided_slice_1/stack:output:0"
      input: "truediv_1/pfor/strided_slice_1/stack_1:output:0"
      input: "truediv_1/pfor/strided_slice_1/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 1
        }
      }
      attr {
        key: "new_axis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "shrink_axis_mask"
        value {
          i: 0
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/concat/axis"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/concat"
      op: "ConcatV2"
      input: "truediv_1/pfor/strided_slice:output:0"
      input: "truediv_1/pfor/Tile:output:0"
      input: "truediv_1/pfor/strided_slice_1:output:0"
      input: "truediv_1/pfor/concat/axis:output:0"
      attr {
        key: "N"
        value {
          i: 3
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tidx"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/Reshape_1"
      op: "Reshape"
      input: "sub_2/pfor/Sub_1:z:0"
      input: "truediv_1/pfor/concat:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "truediv_1/pfor/RealDiv"
      op: "RealDiv"
      input: "truediv_1/pfor/Reshape_1:output:0"
      input: "truediv_1/y/pfor/Const:output:0"
      attr {
        key: "T"
        value {
          type: DT_FLOAT
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Rank"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Rank_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/add/y"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/add"
      op: "AddV2"
      input: "sub_3/pfor/Rank_1:output:0"
      input: "sub_3/pfor/add/y:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Maximum"
      op: "Maximum"
      input: "sub_3/pfor/add:z:0"
      input: "sub_3/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 25
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/sub"
      op: "Sub"
      input: "sub_3/pfor/Maximum:z:0"
      input: "sub_3/pfor/Rank:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Reshape/shape"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Reshape"
      op: "Reshape"
      input: "sub_3/pfor/sub:z:0"
      input: "sub_3/pfor/Reshape/shape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tshape"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Tile/input"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/Tile"
      op: "Tile"
      input: "sub_3/pfor/Tile/input:output:0"
      input: "sub_3/pfor/Reshape:output:0"
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "Tmultiples"
        value {
          type: DT_INT32
        }
      }
    }
    node_def {
      name: "sub_3/pfor/strided_slice/stack"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 0
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/strided_slice/stack_1"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/strided_slice/stack_2"
      op: "Const"
      attr {
        key: "dtype"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "value"
        value {
          tensor {
            dtype: DT_INT32
            tensor_shape {
              dim {
                size: 1
              }
            }
            int_val: 1
          }
        }
      }
    }
    node_def {
      name: "sub_3/pfor/strided_slice"
      op: "StridedSlice"
      input: "sub_3/pfor/Shape:output:0"
      input: "sub_3/pfor/strided_slice/stack:output:0"
      input: "sub_3/pfor/strided_slice/stack_1:output:0"
      input: "sub_3/pfor/strided_slice/stack_2:output:0"
      attr {
        key: "Index"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "T"
        value {
          type: DT_INT32
        }
      }
      attr {
        key: "begin_mask"
        value {
          i: 1
        }
      }
      attr {
        key: "ellipsis_mask"
        value {
          i: 0
        }
      }
      attr {
        key: "end_mask"
        value {
          i: 0
